src/test/resources/gessampleresponses/UKAccessCodeResponseWithDuplicateUKAccessCodeError.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns8:GESMessage xmlns:ns8="http://cbp.dhs.gov/GES/ges-exchange" xmlns:ns7="http://niem.gov/niem/appinfo/2.1"
                        xmlns:ns6="http://niem.gov/niem/appinfo/2.0"
                        xmlns:ns5="http://niem.gov/niem/domains/immigration/2.1" xmlns:ns4="http://cbp.dhs.gov/GES/ges"
                        xmlns:ns3="http://niem.gov/niem/niem-core/2.0"
                        xmlns:ns2="http://niem.gov/niem/domains/screening/2.1"
                        xmlns:ns1="http://niem.gov/niem/structures/2.0" ns1:id="_454a728a-4bff-4815-b159-65238aad25bf">
            <ns4:SchemaVersion>2.1</ns4:SchemaVersion>
            <ns4:Header xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <ns4:Response ns1:id="_e043841f-07e1-4bc4-8910-229a4f969536">
                <ns4:Error>
                    <ns4:GESErrorCode>Other</ns4:GESErrorCode>
                    <ns4:ExplanationText>java.lang.RuntimeException: External Id already created for id UK GET CODE and id category GE7VPHDWZS</ns4:ExplanationText>
                </ns4:Error>
                <ns4:PredicateSetIdentifier xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <ns4:StartingResults>0</ns4:StartingResults>
                <ns4:MaximumResults>0</ns4:MaximumResults>
                <ns4:TotalResults>0</ns4:TotalResults>
                <ns4:AsOfDateTime xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            </ns4:Response>
        </ns8:GESMessage>
    </S:Body>
</S:Envelope>